{
  "create_description": "✏️ Як створити якісний опис послуги?\nДайте потенційним клієнтам максимум корисної інформації\\! Ось кілька порад для створення опису:\n1️⃣ Назва послуги: Напишіть, що саме ви пропонуєте \\(наприклад, \"Ремонт побутової техніки\"\\)\\.\n2️⃣ Що ви робите: Опишіть ключові аспекти вашої послуги – що саме включено та чому це корисно\\.\n\n3️⃣ Ваш досвід: Згадайте, скільки років ви працюєте в цій сфері або ваші досягнення\\.\n4️⃣ Ціна та умови: Якщо можливо, вкажіть вартість або умови співпраці \\(наприклад, \"Ціни від 10 euro\"\\)\\.\n5️⃣ Контактні деталі: Якщо потрібно, додайте, як з вами зв’язатися\\.\n\nПриклад опису:\n\"Пропоную послуги ремонту побутової техніки: холодильників, пральних машин та духовок\\. Досвід роботи – понад 5 років\\. Гарантую якісний ремонт у найкоротші терміни\\. Вартість обговорюється залежно від складності роботи\\.\n\n**Введіть опис вашої послуги** 🔽",
  "create_cities": "🌍 Укажіть міста, в яких ви надаєте послуги \\(через кому\\):\n\n📌 Наприклад: Київ, Львів, Одеса\\.\n\nЦе допоможе вашим потенційним клієнтам зрозуміти, чи доступна ваша послуга у їхньому регіоні\\. Якщо ви працюєте онлайн або по всій країні, можете вказати це, наприклад: \"Вся Франція\" або \"Онлайн\"\\.\n\n✏️ Напишіть ваші міста нижче:",
  "create_phone": "📞 Вкажіть ваш контактний телефон\n📌 Наприклад: 38XXXXXXXX\n\nЦей номер допоможе клієнтам швидко зв’язатися з вами для уточнення деталей або замовлення послуги\\.\n✏️ Напишіть ваш номер телефону нижче:",
  "create_nickname": "💬 Вкажіть ваше ім’я користувача в Telegram\n📌 Наприклад: @username\n\nЦе дозволить клієнтам легко зв’язатися з вами через Telegram для обговорення деталей послуги\\.\n✏️ Напишіть ваш нікнейм у Telegram нижче:",
  "create_fail": "🔄 Створення послуги скасовано. Ми завжди готові допомогти, коли ви будете готові! 🙌",
  "create_success": "✅ Чудово! Ваша послуга створена та тепер доступна для пошуку. Чекайте на запити від клієнтів! 📩 \nДякуємо за використання нашого сервісу! 🙏",
  "create_choose": "📌 Оберіть одну з опцій: \"Підтвердити\" або \"Скасувати\". Це допоможе нам рухатись далі!",
  "services_list": "Ви можете керувати своїми публікаціями в розділі\n📋 Мої послуги",
  "services_deleted": "✅ Послугу успішно видалено! Всі зміни збережено. 😊",
  "services_empty": "📋 У вас поки що немає створених послуг. Почніть зараз, щоб знайти клієнтів! 🚀",
  "services_title": "📜 Дивіться, що ви пропонуєте:",
  "back": "🔙 Назад",
  "accept": "✅ Підтвердити",
  "cancel": "❌ Скасувати",
  "remove": "❌ Видалити"
}
