// Главное меню
import {UserClass} from "../models/User.js";

export const mainMenu = [
    ['🏠 Послуги для дому', '💻 IT та цифрові послуги'],
    ['🚚 Кур’єр, доставка', '🎓 Освіта'],
    ['💅 Краса та здоров’я', '🎭 Творчість та розваги'],
    ['📊 Бізнес послуги', '🛠️ Виробництво та ремонт'],
    ['⚡ Екстрені послуги', '🐾 Послуги для тварин'],
    ['🔙 Назад']
];

// Подкатегории для каждой категории
export const subMenu = [
    [
        [
            ['🌱 Сад і ділянка', '🧹 Прибирання'],
            ['🔧 Ремонт і будівництво', '💡 Послуги електрика'],
            ['🚿 Послуги сантехніка', '🪑 Ремонт меблів'],
            ['🔙 Назад']
        ],
        [
            ['💻 Розробка і програмування', '🎨 Дизайн'],
            ['📈 Маркетинг', '🔧 Технічна підтримка'],
            ['🔍 SEO та контекстна реклама', '📊 Аудит і консалтинг'],
            ['🔙 Назад']
        ]
    ],
    [
        [
            ['🚚 Кур’єрська доставка', '📦 Переїзди'],
            ['🚖 Таксі і трансфери', '⚡ Експрес доставка'],
            ['🛒 Доставка продуктів', '📃 Доставка документів'],
            ['🔙 Назад']
        ],
        [
            ['📚 Репетитори', '🎓 Курси та тренінги'],
            ['✏️ Підготовка до іспитів', '🌍 Мовні курси'],
            ['📝 Допомога з завданнями', '💻 Онлайн навчання'],
            ['🔙 Назад']
        ]
    ],
    [
        [
            ['💆‍♀️ Косметологія', '✂️ Перукарські послуги'],
            ['💅 Послуги нігтьового сервісу', '💆‍♂️ Масаж'],
            ['🍎 Дієтологи', '🏋️‍♀️ Особисті тренери'],
            ['🔙 Назад']
        ],
        [
            ['🎉 Організація заходів', '🎼 Музика'],
            ['📸 Фото та відеозйомка', '🎭 Аніматори та ведучі'],
            ['🎨 Художники та дизайнери', '🍳 Кулінарні послуги'],
            ['🔙 Назад']
        ]
    ],
    [
        [
            ['⚖️ Юридичні послуги', '🌐 Переклади'],
            ['💵 Фінансові послуги', '📑 Бухгалтерія'],
            ['📋 Консалтинг', '🗂️ Розробка бізнес планів'],
            ['🔙 Назад']
        ],
        [
            ['🪑 Виготовлення меблів', '🛠️ Ремонт меблів'],
            ['🖥️ Ремонт техніки', '📱 Ремонт електроніки'],
            ['🎁 Виробництво виробів на замовлення', '⏱️ Ремонт годинників'],
            ['🔙 Назад']
        ]
    ],
    [
        [
            ['🚨 Аварійні служби', '🔑 Розкриття замків'],
            ['🚗 Евакуація авто', '🔒 Заміна замків'],
            ['🛣️ Допомога на дорозі', '🔧 Ремонт авто на місці'],
            ['🔙 Назад']
        ],
        [
            ['🐕 Вигул собак', '🐈 Догляд за котами'],
            ['✂️ Грумінг', '🐾 Ветеринарні послуги'],
            ['🏠 Перетримка тварин', '🐶 Дресирування'],
            ['🔙 Назад']
        ]
    ]
];

export const startMenuButtons = async (id) => {
    const user = await UserClass.findById(id);
    return user.role === 'admin' ? startMenuButtonsAdmin : startMenuButtonsUser
}

const startMenuButtonsUser = [
    ['🛠️ Пропоную послуги', '🔍 Шукаю послуги'],
    ['📋 Мої послуги']
]

export const startMenuButtonsAdmin = [
    ['🛠️ Пропоную послуги', '🔍 Шукаю послуги'],
    ['📋 Мої послуги'],
    ['Кількість користувачів']
]
